Revit 2020 API
ElementNode Properties
The ElementNode type exposes the following members.
Properties
Name | Description
Document
 Gets the document associated with the element.
ElementId
 The Id of the element.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from RenderNode.)
NodeName
 A readable name of the output node.
 (Inherited from RenderNode.)
See Also
ElementNode Class
Autodesk.Revit.DB Namespace